backend: "python"
max_batch_size: 128
name: "nllb"
input [
  {
    name: "INPUT_IDS"
    data_type: TYPE_INT32
    dims: [ -1 ]
    allow_ragged_batch: true
  },
  {
    name: "ATTENTION_MASK"
    data_type: TYPE_INT32
    dims: [ -1 ]
    allow_ragged_batch: true
  }
]
output [
  {
    name: "OUTPUT_IDS"
    data_type: TYPE_INT32
    dims: [ -1 ]
  }
]
instance_group [{ kind: KIND_GPU }]
dynamic_batching {
  max_queue_delay_microseconds: 5000
}

